duerrfk/usb-c-adapter-tester/board_definition/atmega328_8MHz/avr/boards.txt
usbcadaptertester.name=ATmega328P @ 8 MHz

usbcadaptertester.upload.tool=avrdude
usbcadaptertester.upload.protocol=arduino
usbcadaptertester.upload.maximum_size=32256
usbcadaptertester.upload.maximum_data_size=2048
usbcadaptertester.upload.speed=9600

usbcadaptertester.build.mcu=atmega328p
usbcadaptertester.build.f_cpu=8000000L
usbcadaptertester.build.core=arduino:arduino
usbcadaptertester.build.variant=arduino:standard
usbcadaptertester.build.board=ble-v-monitor

#usbcadaptertester.bootloader.low_fuses=0x62
#usbcadaptertester.bootloader.high_fuses=0xD9
#usbcadaptertester.bootloader.extended_fuses=0x06
#usbcadaptertester.bootloader.file=atmega/foo.hex
#usbcadaptertester.bootloader.unlock_bits=0x3F
#usbcadaptertester.bootloader.lock_bits=0x0F
#usbcadaptertester.bootloader.tool=arduino:avrdude

